InformationRegisters/НастройкаРаспределенияПоНаправлениямДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаРаспределенияПоНаправлениямДеятельности</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыРаспределенияПоНаправлениямДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаРаспределенияПоНаправлениямДеятельности/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Запись, ЭтотОбъект);

	Если ТипЗнч(Запись.СпособРаспределения) = Тип("СправочникСсылка.НаправленияДеятельности") Тогда
		ВариантУказанияНаправленияДеятельности = 0;
		НаправлениеДеятельности = Запись.СпособРаспределения;
	Иначе
		ВариантУказанияНаправленияДеятельности = 1;
		СпособРаспределения = Запись.СпособРаспределения;
	КонецЕсли;
	
	Если ТипЗнч(Запись.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
	 И ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		НастройкаПоПозицииНоменклатуры = Истина;
		Номенклатура = Запись.Номенклатура;
		СегментНоменклатуры = Неопределено;
	ИначеЕсли ТипЗнч(Запись.Номенклатура) = Тип("СправочникСсылка.СегментыНоменклатуры")
	 И ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		НастройкаПоСегментуНоменклатуры = Истина;
		СегментНоменклатуры = Запись.Номенклатура;
		Номенклатура = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Запись.Партнер) = Тип("СправочникСсылка.Партнеры") 
	 И ЗначениеЗаполнено(Запись.Партнер) Тогда
		НастройкаПоКлиенту = Истина;
		Клиент = Запись.Партнер;
		СегментПартнеров = Неопределено;
	ИначеЕсли ТипЗнч(Запись.Партнер) = Тип("СправочникСсылка.СегментыПартнеров") 
	 И ЗначениеЗаполнено(Запись.Партнер) Тогда
		НастройкаПоСегментуКлиентов = Истина;
		СегментПартнеров = Запись.Партнер;
		Клиент = Неопределено;
	КонецЕсли;
	
	НастройкаПоПодразделению = ЗначениеЗаполнено(Запись.Подразделение);
	НастройкаПоОрганизации = ЗначениеЗаполнено(Запись.Организация);
	НастройкаПоСкладу = ЗначениеЗаполнено(Запись.Склад);

	Элементы.ГруппаСклад.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов");
	Элементы.ГруппаСегментНоменклатуры.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыНоменклатуры");
	Элементы.ГруппаСегментПартнеров.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыПартнеров");
	
	УстановитьВидимостьПолей();
	УстановитьПараметрыВыбораПартнера();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НастройкаПоКлиенту Тогда
		ТекущийОбъект.Партнер = Клиент;
	ИначеЕсли НастройкаПоСегментуКлиентов Тогда 
		ТекущийОбъект.Партнер = СегментПартнеров;
	Иначе
		ТекущийОбъект.Партнер = Неопределено;
	КонецЕсли;
	Если НастройкаПоПозицииНоменклатуры Тогда
		ТекущийОбъект.Номенклатура = Номенклатура;
	ИначеЕсли НастройкаПоСегментуНоменклатуры Тогда
		ТекущийОбъект.Номенклатура = СегментНоменклатуры;
	Иначе
		ТекущийОбъект.Номенклатура = Неопределено;
	КонецЕсли;
	Если Не НастройкаПоОрганизации Тогда
		ТекущийОбъект.Организация = Неопределено;
	КонецЕсли;
	Если Не НастройкаПоПодразделению Тогда
		ТекущийОбъект.Подразделение = Неопределено;
	КонецЕсли;
	Если Не НастройкаПоСкладу Тогда
		ТекущийОбъект.Склад = Неопределено;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантУказанияНаправленияДеятельностиПриИзменении(Элемент)
	Модифицированность = Истина;
	ВариантУказанияНаправленияДеятельностиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	Модифицированность = Истина;
	Запись.СпособРаспределения = НаправлениеДеятельности;
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияПриИзменении(Элемент)
	Модифицированность = Истина;
	Запись.СпособРаспределения = СпособРаспределения;
КонецПроцедуры

&НаКлиенте
Процедура СегментПартнеровНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопустимыеСпособыФормирования = Новый Массив;
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять"));
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную"));
	СтруктураОтбора = Новый Структура("СпособФормирования", ДопустимыеСпособыФормирования);
	ПараметрыФормы = Новый Структура("Отбор, РежимВыбора", СтруктураОтбора, Истина);
	
	ОткрытьФорму("Справочник.СегментыПартнеров.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СегментПартнеровАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ДопустимыеСпособыФормирования = Новый Массив;
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять"));
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную"));
	ПараметрыПолученияДанных.Отбор = Новый Структура("СпособФормирования", ДопустимыеСпособыФормирования);
КонецПроцедуры

&НаКлиенте
Процедура СегментНоменклатурыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ДопустимыеСпособыФормирования = Новый Массив;
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять"));
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную"));
	ПараметрыПолученияДанных.Отбор = Новый Структура("СпособФормирования", ДопустимыеСпособыФормирования);
КонецПроцедуры

&НаКлиенте
Процедура СегментНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопустимыеСпособыФормирования = Новый Массив;
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять"));
	ДопустимыеСпособыФормирования.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную"));
	СтруктураОтбора = Новый Структура("СпособФормирования", ДопустимыеСпособыФормирования);
	ПараметрыФормы = Новый Структура("Отбор, РежимВыбора", СтруктураОтбора, Истина);
	
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьВидимостьПолей()

	Если ВариантУказанияНаправленияДеятельности = 0 Тогда
		Элементы.СпособРаспределения.Доступность = Ложь;
		Элементы.НаправлениеДеятельности.Доступность = Истина;
	Иначе
		Элементы.СпособРаспределения.Доступность = Истина;
		Элементы.НаправлениеДеятельности.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Партнер.Доступность = НастройкаПоКлиенту;
	Элементы.СегментПартнеров.Доступность = НастройкаПоСегментуКлиентов;
	
	Элементы.Номенклатура.Доступность = НастройкаПоПозицииНоменклатуры;
	Элементы.СегментНоменклатуры.Доступность = НастройкаПоСегментуНоменклатуры;
	
	Элементы.Склад.Доступность = НастройкаПоСкладу;
	Элементы.Подразделение.Доступность = НастройкаПоПодразделению;
	Элементы.Организация.Доступность = НастройкаПоОрганизации;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораПартнера()
	
	МассивПараметров = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПередачиТоваровМеждуОрганизациями") Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Клиент", Истина));
	КонецЕсли;
	
	Элементы.Партнер.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ВариантУказанияНаправленияДеятельностиПриИзмененииСервер()
	
	УстановитьВидимостьПолей();
	Если ВариантУказанияНаправленияДеятельности = 0
	   И ТипЗнч(Запись.СпособРаспределения) <> Тип("СправочникСсылка.НаправленияДеятельности")
	Тогда
		Запись.СпособРаспределения = Справочники.НаправленияДеятельности.ПустаяСсылка();
		СпособРаспределения = Справочники.СпособыРаспределенияПоНаправлениямДеятельности.ПустаяСсылка();
	ИначеЕсли ВариантУказанияНаправленияДеятельности = 1
		И ТипЗнч(Запись.СпособРаспределения) <> Тип("СправочникСсылка.СпособыРаспределенияПоНаправлениямДеятельности")
	Тогда
		Запись.СпособРаспределения = Справочники.СпособыРаспределенияПоНаправлениямДеятельности.ПустаяСсылка();
		НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	КонецЕсли;
	
	Если ВариантУказанияНаправленияДеятельности = 1
	   И Не ЗначениеЗаполнено(Запись.СпособРаспределения) Тогда
		Запись.СпособРаспределения = Справочники.СпособыРаспределенияПоНаправлениямДеятельности.СпособРаспределенияПоУмолчанию(Перечисления.ПравилаРаспределенияПоНаправлениямДеятельности.ПропорциональноКоэффициентам);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоКлиентуПриИзменении(Элемент)
	УстановитьДоступностьКлиентаСегментаКлиентов(Элемент.Имя);
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоСегментуКлиентовПриИзменении(Элемент)
	УстановитьДоступностьКлиентаСегментаКлиентов(Элемент.Имя);
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоПозицииНоменклатурыПриИзменении(Элемент)
	УстановитьДоступностьНоменклатурыСегментаНоменклатуры(Элемент.Имя);
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоСегментуНоменклатурыПриИзменении(Элемент)
	УстановитьДоступностьНоменклатурыСегментаНоменклатуры(Элемент.Имя);
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоСкладуПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоПодразделениюПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоОрганизацииПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКлиентаСегментаКлиентов(ТекущийЭлемент)
	Модифицированность = Истина;
	Если ТекущийЭлемент = "НастройкаПоКлиенту" И НастройкаПоКлиенту Тогда
		НастройкаПоСегментуКлиентов = Ложь;
		СегментПартнеров = "";
	ИначеЕсли ТекущийЭлемент = "НастройкаПоСегментуКлиентов" И НастройкаПоСегментуКлиентов Тогда
		НастройкаПоКлиенту = Ложь;
		Клиент = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьНоменклатурыСегментаНоменклатуры(ТекущийЭлемент)
	Модифицированность = Истина;
	Если ТекущийЭлемент = "НастройкаПоПозицииНоменклатуры" И НастройкаПоПозицииНоменклатуры Тогда
		НастройкаПоСегментуНоменклатуры = Ложь;
		СегментНоменклатуры = "";
	ИначеЕсли ТекущийЭлемент = "НастройкаПоСегментуНоменклатуры" И НастройкаПоСегментуНоменклатуры Тогда
		НастройкаПоПозицииНоменклатуры = Ложь;
		Номенклатура = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
